RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
#include "bl808_uhs_phy.h"
#include <stdlib.h>
#include <stdio.h>
#include <stdint.h>
#include "psram_uhs_reg.h"
#include "glb_reg.h"
#include "pds_reg.h"

#define bl808_DBG_RF (0)    // 0 is for commit with only err log, 1 is for all debug log, 2 is for key debug log
#if bl808_DBG_RF == 1
    #define uhs_phy_printf_debug printf  // debug mode
    #define uhs_phy_printf printf
    #define uhs_phy_printfe printf
#elif bl808_DBG_RF == 2
    #define uhs_phy_printf_debug(...)
    #define uhs_phy_printf printf  // commit it out in release version, use to collect data
    // #define uhs_phy_printf(...) //  used in release version
    #define uhs_phy_printfe printf
#else
    #define uhs_phy_printf_debug(...)
    #define uhs_phy_printf(...)
    #define uhs_phy_printfe printf
#endif

#define ODT_EN (0)
// #define PSRAM_32MB (0)
#define CACHE_EN (0)        // unused !

static uhs_phy_cal_res_struct cal_res;
uhs_phy_cal_res_struct* uhs_phy_cal_res = &cal_res;
static uint8_t err_flag = 0;
#define CHECK_ERR_FLAG(func,args) {\
    func args;\
    if(err_flag)return err_flag;\
}

static uint32_t cache_state = 0;
static uint8_t uhs_latency_code = 1;
static uint32_t dqs_dq_delta = 0;
static uint32_t dcache_original = 0;
static uint32_t dcache_current = 0;
static uint32_t dcache_end = 0;
static uint8_t regr_done_err = 0;
static uint8_t reg_read_err = 0;
static uint8_t reg_write_err = 0;
static uint8_t init_array_write_err = 0;
static uint8_t array_read_err = 0;
static uint32_t addr_dump = 0x3000F000;
//
static uint32_t addr_rarray = 0x50000000;
static uint32_t data0_rarray = 0x12345678;
static uint32_t data1_rarray = 0x87654321;
// uint32_t datarate_glb;
static uint32_t latency_wr[2] = {9,30};
static PSRAM_UHS_Cfg_Type *cfg_glb;
// static uint32_t addr_sr[3] = {0x3000f014,0x3000f018,0x3000f020};
// static uint32_t val_sr[3] = {0x0,0x0,0x0};
static uint32_t latency_wr_2kM[2] = {13,41};
static uint8_t cal_done_flag = 0;
static uint8_t print_flag = 0;
// static uint32_t latency_wr_2kM_init[2] = {13,36};
static uint8_t flag_ck1 = 0;
static uint8_t flag_ck2 = 0;

void set_uhs_latency_w(uint32_t uhs_latency);
void set_uhs_latency_r(uint32_t uhs_latency);
void uhs_reset(uint8_t ma_rb);
void uhs_phy_reg_dump(void);
void set_or_uhs(void);
uint8_t mr_read_back(void);
uint8_t uhs_phy_init_core(PSRAM_UHS_Cfg_Type *cfg);

void uhs_phy_delay_us(uint32_t us)
{
    arch_delay_us(us);
}

void uhs_phy_delay_ms(uint32_t ms)
{
    arch_delay_ms(ms);
}

void uhs_phy_af_reg(uint32_t REG_PCK_T_DIV,uint32_t REG_WIN_CYCLE,uint32_t REG_WIN_REF_CNT,uint32_t REG_REFI_CYCLE,uint32_t REG_BUST_CYCLE)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_MANUAL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_PCK_T_DIV,REG_PCK_T_DIV);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_MANUAL,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_WIN_CYCLE,REG_WIN_CYCLE);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_1,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_WIN_REF_CNT,REG_WIN_REF_CNT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_REFI_CYCLE,REG_REFI_CYCLE);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_2,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_BUST_CYCLE,REG_BUST_CYCLE);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_4,tmpVal);
    // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_AF_EN,0x1);
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);
}

void uhs_phy_af_onoff(uint8_t onoff){
    uint32_t tmpVal = 0;

    if(onoff){
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_AF_EN,0x1);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);
        uhs_phy_delay_us(50);
        // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
        // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_INIT_EN,0x1);
        // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);
        // uhs_phy_delay_us(50);
    }else{
        // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
        // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_INIT_EN,0x0);
        // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);
        // uhs_phy_delay_us(50);
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_AF_EN,0x0);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);
        uhs_phy_delay_us(50);
    }
}

void uhs_phy_af_cfg(void)
{
    // uint32_t tmpVal = 0;

    uhs_phy_af_onoff(0);

    if(cfg_glb->psramMemSize == PSRAM_MEM_SIZE_64MB && cfg_glb->isHighTem == PSRAM_UHS_HIGH_TEMP){
        if(cfg_glb->pck_freq == 2000){
            uhs_phy_af_reg(0x4,0xF423F,0x2000,0x79,0x6);
        }
        else if(cfg_glb->pck_freq == 1900){
            uhs_phy_af_reg(0x4,0xE7EEF,0x2000,0x72,0x6);
        }
        else if(cfg_glb->pck_freq == 1800){
            uhs_phy_af_reg(0x4,0xDBB9F,0x2000,0x6C,0x6);
        }
        else if(cfg_glb->pck_freq == 1700){
            uhs_phy_af_reg(0x4,0xCF84F,0x2000,0x66,0x5);
        }
        else if(cfg_glb->pck_freq == 1600){
            uhs_phy_af_reg(0x4,0xC34FF,0x2000,0x60,0x5);
        }
        else if(cfg_glb->pck_freq == 1500){
            uhs_phy_af_reg(0x4,0xB71AF,0x2000,0x5A,0x5);
        }
        else if(cfg_glb->pck_freq == 1400){
            uhs_phy_af_reg(0x4,0xAAE5F,0x2000,0x54,0x4);
        }
        else if(cfg_glb->pck_freq == 1300){
            uhs_phy_af_reg(0x4,0x9EB0F,0x2000,0x4E,0x4);
        }
        else if(cfg_glb->pck_freq == 1200){
            uhs_phy_af_reg(0x4,0x927BF,0x2000,0x48,0x4);
        }
        else if(cfg_glb->pck_freq == 1100){
            uhs_phy_af_reg(0x4,0x8646F,0x2000,0x42,0x4);
        }
        else if(cfg_glb->pck_freq == 1000){
            uhs_phy_af_reg(0x4,0x7A11F,0x2000,0x3C,0x3);
        }
        else if(cfg_glb->pck_freq == 900){
            uhs_phy_af_reg(0x4,0x6DDCF,0x2000,0x35,0x3);
        }
        else{
            uhs_phy_af_reg(0x4,0x61A7F,0x2000,0x2F,0x3);
        }
    }
    else if(cfg_glb->psramMemSize == PSRAM_MEM_SIZE_64MB){
        if(cfg_glb->pck_freq == 2000){
            uhs_phy_af_reg(0x4,0x1E847F,0x2000,0xF3,0x6);
        }
        else if(cfg_glb->pck_freq == 1900){
            uhs_phy_af_reg(0x4,0x1CFDDF,0x2000,0xE6,0x6);
        }
        else if(cfg_glb->pck_freq == 1800){
            uhs_phy_af_reg(0x4,0x1B773F,0x2000,0xDA,0x6);
        }
        else if(cfg_glb->pck_freq == 1700){
            uhs_phy_af_reg(0x4,0x19F09F,0x2000,0xCE,0x5);
        }
        else if(cfg_glb->pck_freq == 1600){
            uhs_phy_af_reg(0x4,0x1869FF,0x2000,0xC2,0x5);
        }
        else if(cfg_glb->pck_freq == 1500){
            uhs_phy_af_reg(0x4,0x16E35F,0x2000,0xB6,0x5);
        }
        else if(cfg_glb->pck_freq == 1400){
            uhs_phy_af_reg(0x4,0x155CBF,0x2000,0xA9,0x4);
        }
        else if(cfg_glb->pck_freq == 1300){
            uhs_phy_af_reg(0x4,0x13D61F,0x2000,0x9D,0x4);
        }
        else if(cfg_glb->pck_freq == 1200){
            uhs_phy_af_reg(0x4,0x124F7F,0x2000,0x91,0x4);
        }
        else if(cfg_glb->pck_freq == 1100){
            uhs_phy_af_reg(0x4,0x10C8DF,0x2000,0x85,0x4);
        }
        else if(cfg_glb->pck_freq == 1000){
            uhs_phy_af_reg(0x4,0xF423F,0x2000,0x79,0x3);
        }
        else if(cfg_glb->pck_freq == 900){
            uhs_phy_af_reg(0x4,0xDBB9F,0x2000,0x6C,0x3);
        }
        else{
            uhs_phy_af_reg(0x4,0xC34FF,0x2000,0x60,0x3);
        }
    }
    else if(cfg_glb->psramMemSize == PSRAM_MEM_SIZE_32MB && cfg_glb->isHighTem == PSRAM_UHS_HIGH_TEMP){
        if(cfg_glb->pck_freq == 2000){
            uhs_phy_af_reg(0x4,0xF423F,0x1000,0xF3,0x6);
        }
        else if(cfg_glb->pck_freq == 1900){
            uhs_phy_af_reg(0x4,0xE7EEF,0x1000,0xE6,0x6);
        }
        else if(cfg_glb->pck_freq == 1800){
            uhs_phy_af_reg(0x4,0xDBB9F,0x1000,0xDA,0x6);
        }
        else if(cfg_glb->pck_freq == 1700){
            uhs_phy_af_reg(0x4,0xCF84F,0x1000,0xCE,0x5);
        }
        else if(cfg_glb->pck_freq == 1600){
            uhs_phy_af_reg(0x4,0xC34FF,0x1000,0xC2,0x5);
        }
        else if(cfg_glb->pck_freq == 1500){
            uhs_phy_af_reg(0x4,0xB71AF,0x1000,0xB6,0x5);
        }
        else if(cfg_glb->pck_freq == 1400){
            uhs_phy_af_reg(0x4,0xAAE5F,0x1000,0xA9,0x4);
        }
        else if(cfg_glb->pck_freq == 1300){
            uhs_phy_af_reg(0x4,0x9EB0F,0x1000,0x9D,0x4);
        }
        else if(cfg_glb->pck_freq == 1200){
            uhs_phy_af_reg(0x4,0x927BF,0x1000,0x91,0x4);
        }
        else if(cfg_glb->pck_freq == 1100){
            uhs_phy_af_reg(0x4,0x8646F,0x1000,0x85,0x4);
        }
        else if(cfg_glb->pck_freq == 1000){
            uhs_phy_af_reg(0x4,0x7A11F,0x1000,0x79,0x3);
        }
        else if(cfg_glb->pck_freq == 900){
            uhs_phy_af_reg(0x4,0x6DDCF,0x1000,0x6C,0x3);
        }
        else{
            uhs_phy_af_reg(0x4,0x61A7F,0x1000,0x60,0x3);
        }
    }
    else{
        if(cfg_glb->pck_freq == 2000){
            uhs_phy_af_reg(0x4,0x1E847F,0x1000,0x1E7,0x6);
        }
        else if(cfg_glb->pck_freq == 1900){
            uhs_phy_af_reg(0x4,0x1CFDDF,0x1000,0x1CE,0x6);
        }
        else if(cfg_glb->pck_freq == 1800){
            uhs_phy_af_reg(0x4,0x1B773F,0x1000,0x1B6,0x6);
        }
        else if(cfg_glb->pck_freq == 1700){
            uhs_phy_af_reg(0x4,0x19F09F,0x1000,0x19E,0x5);
        }
        else if(cfg_glb->pck_freq == 1600){
            uhs_phy_af_reg(0x4,0x1869FF,0x1000,0x185,0x5);
        }
        else if(cfg_glb->pck_freq == 1500){
            uhs_phy_af_reg(0x4,0x16E35F,0x1000,0x16D,0x5);
        }
        else if(cfg_glb->pck_freq == 1400){
            uhs_phy_af_reg(0x4,0x155CBF,0x1000,0x154,0x4);
        }
        else if(cfg_glb->pck_freq == 1300){
            uhs_phy_af_reg(0x4,0x13D61F,0x1000,0x13C,0x4);
        }
        else if(cfg_glb->pck_freq == 1200){
            uhs_phy_af_reg(0x4,0x124F7F,0x1000,0x123,0x4);
        }
        else if(cfg_glb->pck_freq == 1100){
            uhs_phy_af_reg(0x4,0x10C8DF,0x1000,0x10B,0x4);
        }
        else if(cfg_glb->pck_freq == 1000){
            uhs_phy_af_reg(0x4,0xF423F,0x1000,0xF3,0x3);
        }
        else if(cfg_glb->pck_freq == 900){
            uhs_phy_af_reg(0x4,0xDBB9F,0x1000,0xDA,0x3);
        }
        else{
            uhs_phy_af_reg(0x4,0xC34FF,0x1000,0xC2,0x3);
        }
    }

    uhs_phy_af_onoff(1);
}

