RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
void switch_to_ldo12uhs(void)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_40);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_DMY1,0xcc);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_40,tmpVal);
    uhs_phy_delay_us(200);
}

void release_cen_ck_ckn(void)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_40);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_DMY1,0xcf);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_DMY0,0x0);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_40,tmpVal);
    uhs_phy_delay_us(10);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_50);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ_OE_MID_P_REG,0x3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ_OE_MID_N_REG,0x3);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_50,tmpVal);
    uhs_phy_delay_us(10);
}

void uhs_phy_pwr_down(void)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(GLB_BASE,GLB_LDO12UHS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,GLB_LDO12UHS_PULLDOWN_SEL,0x0);
    BL_WR_REG(GLB_BASE,GLB_LDO12UHS,tmpVal);
    uhs_phy_delay_us(100);
    tmpVal = BL_RD_REG(GLB_BASE,GLB_LDO12UHS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,GLB_PU_LDO12UHS,0x0);
    BL_WR_REG(GLB_BASE,GLB_LDO12UHS,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_40);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_DMY1,0xff);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_40,tmpVal);
    uhs_phy_delay_us(100);
    tmpVal = BL_RD_REG(GLB_BASE,GLB_LDO12UHS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,GLB_PU_UHSPLL_SFREG,0x0);
    BL_WR_REG(GLB_BASE,GLB_LDO12UHS,tmpVal);
    uhs_phy_delay_us(100);
}

void psram_init(void)
{
    uint8_t i;
    uint32_t tmpVal = 0;
    for (i = 0; i < 1; i++){
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
        // if (cfg_glb->psramMemSize == PSRAM_MEM_SIZE_32MB){
        //     tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_ADDRMB_MSK,0x1f); // 3F -> 512Mb psram, 1F -> 256Mb psram
        // }else if(cfg_glb->psramMemSize == PSRAM_MEM_SIZE_64MB){
        //     tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_ADDRMB_MSK,0x3f); // 3F -> 512Mb psram, 1F -> 256Mb psram
        // }
        // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_LINEAR_BND_B,0xb);
        // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_INIT_EN,0x1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_CONFIG_REQ,0x1);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);
        uhs_phy_delay_us(10);
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_GLBR_PULSE,0x1);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD,tmpVal);
        uhs_phy_delay_us(100);
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_CONFIG_REQ,0x0);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);
        uhs_phy_delay_us(100);
    }

    // // psram auto refresh at 2000Mbps
    // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_1);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_WIN_CYCLE,0x001E0C4);
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_1,tmpVal);
    // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_2);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_WIN_REF_CNT,0x1007);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_REFI_CYCLE,0x01d);
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_2,tmpVal);
    // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_4);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_BUST_CYCLE,0x1);
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_AUTO_FRESH_4,tmpVal);
    // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_MANUAL);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_PCK_T_DIV,0x40);
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_MANUAL,tmpVal);
    // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_AF_EN,0x1);
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);

    // // psram cmd timing < 2000Mbps
    // BL_WR_WORD(0x3000F030,0x18090610);
}

void set_uhs_phy_init(void)
{
    // set phy & controller
    uint32_t tmpVal = 0;
    // default latency(800MHz)
    // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_RL_ANA,0x2);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_RL_DIG,0x7);
    // // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_ANA,0x0);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_ANA,0x1);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_DIG,0x2);
    // // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_DQ_ANA,0x1);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_DQ_ANA,0x2);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_DQ_DIG,0x2);
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_ODT_SEL,0x0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_OE_CTRL_HW,0x1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_VREF_MODE,0x1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_OE_TIMER,0x3);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30,tmpVal);
    if (cfg_glb->psramMemSize == PSRAM_MEM_SIZE_32MB){
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_34,0x05000501);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_38,0x02080108);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_3C,0x03e90b0b);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_44,0x040b0308);
    }else if(cfg_glb->psramMemSize == PSRAM_MEM_SIZE_64MB){
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_34,0x09020303);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_38,0x040c0313);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_3C,0x07d11515);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_44,0x060f050c);
    }
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_50);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_CEN_ANA,0x1);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_50,tmpVal);
    uhs_phy_delay_us(100);
}

void set_uhs_phy(void)
{
    uint32_t tmpVal = 0;
    // set phy & controller
    // latency code=3 (1066MHz)
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30,0x0f0a1323);  // if fail than use 0x0f391323
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30,0x0f0a0313); // tDQSS -> -1
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30,0x0f0a3233); // tDQSS -> 1
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_ODT_SEL,0x0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_OE_CTRL_HW,0x1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_VREF_MODE,0x1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_OE_TIMER,0x3);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30,tmpVal);
    set_uhs_latency_w(latency_wr[0]);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_34,0x0b030404);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_38,0x050e0418);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_3C,0x0a6a1c1c);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_44,0x07110710);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_50,0x01333333);

    uhs_phy_delay_us(100);
}

uint8_t uhs_err_handler(uint8_t err)
{
    err_flag = 1;
    uhs_phy_cal_res->err_type = err;
#ifndef BFLB_BOOT2
    switch (err) {
        case UHS_REGR_GNT_ERR:
            uhs_phy_printfe("UHS_REGR_GNT_ERR\r\n");
            break;
        case UHS_REGR_DONE_ERR:
            uhs_phy_printfe("UHS_REGR_DONE_ERR = %d\r\n",regr_done_err);
            uhs_phy_cal_res->err_sub_type = regr_done_err;
            break;
        case UHS_REGW_GNT_ERR:
            uhs_phy_printfe("UHS_REGW_GNT_ERR\r\n");
            break;
        case UHS_REGW_DONE_ERR:
            uhs_phy_printfe("UHS_REGW_DONE_ERR\r\n");
            break;
        case UHS_LATENCY_CODE_WRITE_ERR:
            uhs_phy_printfe("UHS_LATENCY_CODE_WRITE_ERR\r\n");
            break;
        case UHS_INIT_ARRAY_WRITE_ERR:
            uhs_phy_printfe("UHS_INIT_ARRAY_WRITE_ERR = %d\r\n",init_array_write_err);
            uhs_phy_cal_res->err_sub_type = init_array_write_err;
            break;
        case UHS_REG_READ_CAL_ERR:
            uhs_phy_printfe("UHS_REG_READ_CAL_ERR = %d\r\n",reg_read_err);
            uhs_phy_cal_res->err_sub_type = reg_read_err;
            break;
        case UHS_REG_WRITE_CAL_ERR:
            uhs_phy_printfe("UHS_REG_WRITE_CAL_ERR = %d\r\n",reg_write_err);
            uhs_phy_cal_res->err_sub_type = reg_write_err;
            break;
        case UHS_ARRAY_READ_LAT_ERR:
            uhs_phy_printfe("UHS_ARRAY_READ_LAT_ERR = %d\r\n",array_read_err);
            uhs_phy_cal_res->err_sub_type = array_read_err;
            break;
        case UHS_ARRAY_WRITE_CK_ERR:
            uhs_phy_printfe("UHS_ARRAY_WRITE_CK_ERR\r\n");
            break;
        case UHS_ARRAY_READ_CAL_ERR:
            uhs_phy_printfe("UHS_ARRAY_READ_CAL_ERR\r\n");
            break;
        case UHS_ARRAY_WRITE_CAL_ERR:
            uhs_phy_printfe("UHS_ARRAY_WRITE_CAL_ERR\r\n");
            break;
        case UHS_CACHE_ENABLE_ERR:
            uhs_phy_printfe("UHS_CACHE_ENABLE_ERR\r\n");
            break;
        case UHS_CACHE_DISABLE_ERR:
            uhs_phy_printfe("UHS_CACHE_DISABLE_ERR\r\n");
            break;
        case UHS_CACHE_RECOVER_ERR:
            uhs_phy_printfe("UHS_CACHE_RECOVER_ERR\r\n");
            break;
        case UHS_REG_WRITE_2kM_ERR:
            uhs_phy_printfe("UHS_REG_WRITE_2kM_ERR\r\n");
            break;
        case UHS_BAD_DIE_ERR:
            uhs_phy_printfe("UHS_BAD_DIE_ERR\r\n");
            break;
        case UHS_DIAGONAL_TEST_ERR:
            uhs_phy_printfe("UHS_DIAGONAL_TEST_ERR\r\n");
            break;
        case UHS_ALL_ADDR_TEST_ERR:
            uhs_phy_printfe("UHS_ALL_ADDR_TEST_ERR\r\n");
            break;
        default:
            break;
    }
    uhs_phy_printfe("ERR_AT %ldMbps\r\n",cfg_glb->pck_freq);
    uhs_phy_reg_dump();
#else
    uhs_phy_printfe("uhs_err_handler:%d\r\n",err);
#endif
    #if CAL_MODE == 0 || CAL_MODE == 1
    while(1){
        uhs_phy_printfe("%d",err);
        uhs_phy_delay_ms(10000);
    };
    #endif
    return err_flag;
}

void uhs_phy_reg_dump(void){
    uint32_t len = 0x150;
    uint32_t i = 0;

    // uhs_phy_printf_debug("UHS_PHY_REG_DUMP_START\r\n");
    // for(i = 0;i <= len;i = i+4){
    //     uhs_phy_printf_debug("0x%lx,0x%lx\r\n",(addr_dump + i),*((volatile uint32_t*)(addr_dump + i)));
    // }
    // uhs_phy_printf_debug("UHS_PHY_REG_DUMP_END\r\n");
    uhs_phy_printfe("UHS_PHY_REG_DUMP_START\r\n");
    for(i = 0;i <= len;i = i+4){
        uhs_phy_printfe("0x%lx,0x%lx\r\n",(addr_dump + i),*((volatile uint32_t*)(addr_dump + i)));
    }
    uhs_phy_printfe("UHS_PHY_REG_DUMP_END\r\n");
}

uint8_t uhs_reg_w(uint32_t uhs_latency,uint32_t uhs_drive,uint32_t ma,uint32_t BL_32)
{
    uint32_t tmpVal = 0;
    uint32_t count = 0;
    if(ma == 0)
    {
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_PSRAM_CONFIGURE);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_LATENCY,uhs_latency);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_DRIVE_ST,uhs_drive);
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_PSRAM_CONFIGURE,tmpVal);
    }
    else if(ma == 2)
    {
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_PSRAM_CONFIGURE);
        if (BL_32 == 1){
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_BL_64,0x1);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_BL_32,0x1);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_BL_16,0x0);
        }else if (BL_32 == 2){
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_BL_64,0x0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_BL_32,0x1);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_BL_16,0x1);
        }else{
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_BL_64,0x0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_BL_32,0x0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_UHS_BL_16,0x0);
        }
        BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_PSRAM_CONFIGURE,tmpVal);
    }
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_MODE_REG,ma); //reg_mode_reg
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_CONFIG_REQ,0x1);  //reg_config_req
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);
    // uhs_phy_printf_debug("reg_w GNT while\r\n");
    while (1)
    {
        if (count == 100000){
            return uhs_err_handler(UHS_REGW_GNT_ERR);
        }
        uhs_phy_delay_us(10);
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
        tmpVal = BL_GET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_CONFIG_GNT);
        if (tmpVal == 1)
        {
            uhs_phy_printf_debug("reg_w GNT pass\r\n");
            break;
        }
        count ++;
    }

