RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
void uhs_reset(uint8_t ma_rb)
{
    // uint32_t tmpVal = 0;
    // uint32_t len = 0x150;
    // uint32_t val_sr[len>>2];
    // int32_t i = 0;

    uhs_phy_printf("IN_UHS_RESET\r\n");

    // for( i = len ; i >= 0 ; i = i-4 ){
    //     if( i != 0x4 ){
    //         val_sr[i>>2] = *((volatile uint32_t*)(addr_dump + i));
    //     }
    // }

    // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_AF_EN,0);
    // BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);
    // uhs_phy_delay_us(100);

    // tmpVal = BL_RD_WORD(0x30007044);
    // tmpVal = tmpVal | 0x00008000;
    // BL_WR_WORD(0x30007044,tmpVal);
    // uhs_phy_delay_us(100);
    // tmpVal = tmpVal & 0xFFFF7FFF;
    // BL_WR_WORD(0x30007044,tmpVal);
    // uhs_phy_delay_us(200);

    // BL_WR_WORD(0x3000F030,0x18090610);

    // #if PSRAM_32MB
    // PSRAM_UHS_Cfg_Type psramCfg = {
    //  datarate,
    //  PSRAM_MEM_SIZE_32MB,
    //  PSRAM_PAGE_SIZE_2KB,
    //  0,
    // };
    // #else
    // PSRAM_UHS_Cfg_Type psramCfg = {
    //  datarate,
    //  PSRAM_MEM_SIZE_64MB,
    //  PSRAM_PAGE_SIZE_2KB,
    //  0,
    // };
    // #endif
    // Psram_UHS_Init_Override(cfg_glb); //controller init

    // set_or_uhs();
    // set_uhs_phy();

    // for( i = len ; i >= 0 ; i = i-4 ){
    //     if( i != 0x4 ){
    //         *((volatile uint32_t*)(addr_dump + i)) = val_sr[i>>2];
    //     }
    // }
    // uhs_phy_delay_us(400);

    if (ma_rb){
        mr_read_back();
    }else{
        power_up_mm(1);
        uhs_phy_pwr_down();
        latency_wr_2kM[1] --;
        uhs_phy_init_core(cfg_glb);
    }

    uhs_phy_printf("OUT_UHS_RESET\r\n");
}

void set_uhs_latency_r(uint32_t uhs_latency)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_RL_ANA,uhs_latency%4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_RL_DIG,uhs_latency/4);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30,tmpVal);
    uhs_phy_delay_us(50);
}

void set_uhs_latency_w(uint32_t uhs_latency)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_ANA,uhs_latency%4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_DIG,uhs_latency/4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_DQ_ANA,(uhs_latency+1)%4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_PHY_WL_DQ_DIG,(uhs_latency+1)/4);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30,tmpVal);
    uhs_phy_delay_us(50);
}

uint8_t mr_read_back(void)
{
    uint8_t cnt1;
    uint32_t tmpVal;
    for (cnt1=0;cnt1<=4;cnt1++){
        if(cnt1 != 3){
            CHECK_ERR_FLAG(uhs_reg_r,(cnt1,0));
            tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
            uhs_phy_printf("MA%d = 0x%lx\r\n",cnt1,tmpVal);
        }
    }
    return 0;
}

uint8_t reg_read_cal(void)
{
    uint32_t tmpVal = 0;
    uint32_t tmpVal_1 = 1;
    uint32_t uhs_latency = 42;
    int32_t i = 0;
    uint8_t dqs_dq_flag = 0;
    uint32_t reg_dqs = 0;
    uint32_t reg_dq = 0;

    // for(uhs_latency = 41; uhs_latency > 0; uhs_latency --)
    for(uhs_latency = latency_wr_2kM[1]; uhs_latency > 0; uhs_latency --)
    {
        if(uhs_latency == 34)
        {
            reg_read_err = 1;
            return uhs_err_handler(UHS_REG_READ_CAL_ERR);
        }
        uhs_phy_printf_debug("reg read cal 1st by latency= %ld\r\n",uhs_latency);
        set_uhs_latency_r(uhs_latency);

        // sweep dqs
        cfg_dq_rx(0);
        for(i = 15; i >= 0; i --)
        {
            cfg_dqs_rx(i);
            // tmpVal_1 = uhs_reg_r(0,1);
            CHECK_ERR_FLAG(uhs_reg_r,(0,1));
            if (cal_done_flag == 1)
                return 0;
            tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
            uhs_phy_printf_debug("PSRAM_UHS_UHS_CMD>>24 1st dqs--, 0x%lx\r\n",tmpVal);
            if(tmpVal == ((2<<3)+uhs_latency_code) && (tmpVal_1 == 1)){
                uhs_phy_printf_debug("reg read pass by dqs= %ld\r\n",i);
                // reg_dqs = i;
                dqs_dq_flag = 1;
                break;
            }
            else{
                uhs_phy_printf_debug("reg read fail by dqs= %ld\r\n",i);
            }
            // if(tmpVal_1 == 0){
            //  uhs_phy_printf_debug("read done not found!!!\r\n");
            //  // uhs_reset(datarate);
            //  set_uhs_latency_r(uhs_latency);
            //  cfg_dq_rx(0);
            // }
        }

        // sweep dq
        cfg_dqs_rx(0);
        for(i = 15; i >=0; i --)
        {
            cfg_dq_rx(i);
            // tmpVal_1 = uhs_reg_r(0,1);
            CHECK_ERR_FLAG(uhs_reg_r,(0,1));
            if (cal_done_flag == 1)
                return 0;
            tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
            uhs_phy_printf_debug("PSRAM_UHS_UHS_CMD>>24 1st dq--, 0x%lx\r\n",tmpVal);
            if(tmpVal == ((2<<3)+uhs_latency_code) && (tmpVal_1 == 1)){
                uhs_phy_printf_debug("reg read pass by dq= %ld\r\n",i);
                // reg_dq = i;
                dqs_dq_flag = 1;
                break;
            }
            else{
                uhs_phy_printf_debug("reg read fail by dq= %ld\r\n",i);
            }
            // if(tmpVal_1 == 0){
            //  uhs_phy_printf_debug("read done not found!!!\r\n");
            //  // uhs_reset(datarate);
            //  set_uhs_latency_r(uhs_latency);
            //  cfg_dqs_rx(0);
            // }
        }
        if (dqs_dq_flag == 1){
            dqs_dq_flag = 0;

            uhs_latency = uhs_latency - 2;
            uhs_phy_printf_debug("reg read cal 2nd by latency= %ld\r\n",uhs_latency);
            set_uhs_latency_r(uhs_latency);  //got a good robust uhs_latency
            latency_wr[1] = uhs_latency;
            //******verify the uhs_latency and get dqs/dq timing
            //sweep dqs
            cfg_dq_rx(0);
            for(i = 15; i >= 0; i --)
            {
                cfg_dqs_rx(i);
                CHECK_ERR_FLAG(uhs_reg_r,(0,0));
                tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
                uhs_phy_printf_debug("PSRAM_UHS_UHS_CMD>>24 2nd dqs--, 0x%lx\r\n",tmpVal);
                if(tmpVal == ((2<<3)+uhs_latency_code))
                {
                    uhs_phy_printf("reg read pass by --dqs= %ld\r\n",i);
                    reg_dqs += i;
                    dqs_dq_flag = 1;
                    break;
                }
                else{
                    uhs_phy_printf_debug("reg read fail by dqs= %ld\r\n",i);
                }
            }
            for(i = 0; i <= 15; i ++)
            {
                cfg_dqs_rx(i);
                CHECK_ERR_FLAG(uhs_reg_r,(0,0));
                tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
                uhs_phy_printf_debug("PSRAM_UHS_UHS_CMD>>24 2nd dqs++, 0x%lx\r\n",tmpVal);
                if(tmpVal == ((2<<3)+uhs_latency_code))
                {
                    uhs_phy_printf("reg read pass by ++dqs= %ld\r\n",i);
                    reg_dqs += i;
                    dqs_dq_flag = 1;
                    break;
                }
                else{
                    uhs_phy_printf_debug("reg read fail by dqs= %ld\r\n",i);
                }
            }
            // sweep dq
            cfg_dqs_rx(0);
            for(i = 15; i >= 0; i --)
            {
                cfg_dq_rx(i);
                CHECK_ERR_FLAG(uhs_reg_r,(0,0));
                tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
                uhs_phy_printf_debug("PSRAM_UHS_UHS_CMD>>24 2nd dq--, 0x%lx\r\n",tmpVal);
                if(tmpVal == ((2<<3)+uhs_latency_code))
                {
                    uhs_phy_printf("reg read pass by --dq= %ld\r\n",i);
                    reg_dq += i;
                    dqs_dq_flag = 1;
                    break;
                }
                else{
                    uhs_phy_printf_debug("reg read fail by dq= %ld\r\n",i);
                }
            }
            for(i = 0; i <= 15; i ++)
            {
                cfg_dq_rx(i);
                CHECK_ERR_FLAG(uhs_reg_r,(0,0));
                tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
                uhs_phy_printf_debug("PSRAM_UHS_UHS_CMD>>24 2nd dq++, 0x%lx\r\n",tmpVal);
                if(tmpVal == ((2<<3)+uhs_latency_code))
                {
                    uhs_phy_printf("reg read pass by ++dq= %ld\r\n",i);
                    reg_dq += i;
                    dqs_dq_flag = 1;
                    break;
                }
                else{
                    uhs_phy_printf_debug("reg read fail by dq= %ld\r\n",i);
                }
            }

            if(dqs_dq_flag == 0)
            {
                reg_read_err = 2;
                return uhs_err_handler(UHS_REG_READ_CAL_ERR);
            }

            if(reg_dqs >= reg_dq)
            {
                reg_dqs = (reg_dqs-reg_dq)/2;
                reg_dq = 0;
            }
            else
            {
                reg_dq = (reg_dq-reg_dqs)/2;
                reg_dqs = 0;
            }

            // set dqs & dq by register read calibration result
            cfg_dqs_rx(reg_dqs);
            cfg_dq_rx(reg_dq);
            CHECK_ERR_FLAG(mr_read_back,());
            uhs_phy_printf("reg_read_cal pass, latency= %ld, dqs= %ld, dq= %ld\r\n",uhs_latency,reg_dqs,reg_dq);
            break;
        }
    }

