RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
    return 0;
}

void cfg_dq_drv(uint32_t dq){
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_04);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DM0_DLY_DRV,dq);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DM1_DLY_DRV,dq);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_04,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_24);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ15_DLY_DRV,dq);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ14_DLY_DRV,dq);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_24,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_20);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ13_DLY_DRV,dq);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ12_DLY_DRV,dq);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_20,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_1C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ11_DLY_DRV,dq);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ10_DLY_DRV,dq);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_1C,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_18);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ9_DLY_DRV,dq);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ8_DLY_DRV,dq);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_18,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_14);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ7_DLY_DRV,dq);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ6_DLY_DRV,dq);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_14,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_10);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ5_DLY_DRV,dq);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ4_DLY_DRV,dq);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_10,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_0C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ3_DLY_DRV,dq);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ2_DLY_DRV,dq);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_0C,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_08);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ1_DLY_DRV,dq);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ0_DLY_DRV,dq);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_08,tmpVal);
    // uhs_phy_delay_us(10);
}

void cfg_dqs_drv(uint32_t dqs){
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_28);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQS0_DLY_DRV,dqs);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_28,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_2C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQS1_DLY_DRV,dqs);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_2C,tmpVal);
    uhs_phy_delay_us(10);
}

uint8_t reg_write_cal(void)  //only need sweep dqs
{
    uint32_t tmpVal = 0;
    // uint32_t tmpVal_1 = 0;
    int32_t i = 0;
    uint32_t reg_dqs;
    uint32_t reg_dq = 0;
    uint32_t reg_dqs1 = 0;
    uint32_t reg_dqs2 = 0;
    uint8_t dqs_dq_flag1 = 0;
    uint8_t dqs_dq_flag2 = 0;
    // reg_write_err = 0;

    // sweep1 dqs
    for(i = 15; i >=0; i --)
    {
        cfg_dqs_drv(i);
        CHECK_ERR_FLAG(uhs_reg_w,(uhs_latency_code,2,2,1)); //uhs_latency_code==3,uhs_drive==2,ma==2,BL_32==1
        CHECK_ERR_FLAG(uhs_reg_r,(2,0));
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
        if(tmpVal == (16 + 32))
            {
                uhs_phy_printf("reg write pass by -- dqs1= %ld\r\n",i);
                reg_dqs1 = i;
                dqs_dq_flag1 = 1;
                break;
            }
        else{
            uhs_phy_printf_debug("reg write fail by -- dqs1= %ld\r\n",i);
        }
    }
    // sweep2 dqs
    for(i = 0; i <=15; i ++)
    {
        cfg_dqs_drv(i);
        CHECK_ERR_FLAG(uhs_reg_w,(uhs_latency_code,2,2,2));  //uhs_latency_code==3,uhs_drive==2,ma==2,BL_32==0,BL_64==1
        CHECK_ERR_FLAG(uhs_reg_r,(2,0));
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
        if(tmpVal == (8 + 16))
            {
                uhs_phy_printf("reg write pass by ++ dqs2= %ld\r\n",i);
                reg_dqs2 = i;
                dqs_dq_flag2 = 1;
                break;
            }
        else{
            uhs_phy_printf_debug("reg write fail by ++ dqs2= %ld\r\n",i);
        }
    }

    if(dqs_dq_flag1 == 1 && dqs_dq_flag2 == 1){
        reg_dqs = (reg_dqs1 + reg_dqs2) / 2 ;
    }else if(dqs_dq_flag1 == 1 && dqs_dq_flag2 == 0){
        reg_dqs = reg_dqs1;
    }else if(dqs_dq_flag1 == 0 && dqs_dq_flag2 == 1){
        reg_dqs = reg_dqs2;
    }
    else{
        reg_write_err = 1;
        return uhs_err_handler(UHS_REG_WRITE_CAL_ERR);
    }

    // if ck_dly_drv = 4, fix reg_dqs to 0
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_00);
    tmpVal = (tmpVal >> 16) & 0xF;
    if(tmpVal == 4){
        reg_dqs = 0;
    }
    // set dqs by register write cal result
    cfg_dqs_drv(reg_dqs);
    CHECK_ERR_FLAG(uhs_reg_w,(uhs_latency_code,2,2,0)); //uhs_latency_code==3,uhs_drive==2,ma==2,BL_32==1
    CHECK_ERR_FLAG(uhs_reg_r,(2,0));
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
    if(tmpVal == 0){
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_08);
        reg_dq = BL_GET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ0_DLY_DRV);
        uhs_phy_printf("reg write cal pass dqs= %ld, dq= %ld\r\n",reg_dqs,reg_dq);
    }
    else{
        reg_write_err = 2;
        return uhs_err_handler(UHS_REG_WRITE_CAL_ERR);
    }

    dqs_dq_delta = 16 + reg_dqs - reg_dq;
    uhs_phy_printf("reg_write_cal return dqs_dq_delta= %ld\r\n",dqs_dq_delta);

    return 0;
}

void array_write_fix(uint32_t addr,uint32_t len,uint32_t data0,uint32_t data1)
{
    uint32_t addr_tmp = addr;
    uint32_t data = data0;
    uint32_t i = 0;

    if (print_flag){
        uhs_phy_printf("IN_ARRAY_WRITE_FIX\r\n");
    }
    for(i = 0; i < (len>>2); i ++)
    {
        addr_tmp = (i << 2) + addr;
        if((i % 2) == 0)
            data = data0 + i;
        else
            data = data1 + i;

        BL_WR_WORD(addr_tmp,data);
    }
    if (print_flag){
        uhs_phy_printf("BEFORE CACHE FUCNTION\r\n");
    }
    if (cache_state){
        // #if CACHE_EN
        __DSB();
        __ISB();
        L1C_DCache_Clean_Invalid_All();
        __DSB();
        __ISB();
        // #endif
    }
    uhs_phy_delay_us(10);
    if (print_flag){
        uhs_phy_printf("OUT_ARRAY_WRITE_FIX\r\n");
    }
}

uint8_t array_read_fix(uint32_t addr,uint32_t len,uint32_t data0,uint32_t data1)
{
    uint8_t array_read_pass = 1;
    uint32_t addr_tmp = addr;
    uint32_t data = data0;
    uint32_t data_read = 0;
    uint32_t i = 0;

