RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
    if (print_flag){
        uhs_phy_printf("IN_ARRAY_READ_FIX\r\n");
    }
    for(i = 0; i < (len>>2); i ++)
    {
        // data_read = 0;
        // data_read += *((volatile uint8_t *)(addr+(i<<2)+3));
        // data_read <<= 8;
        // data_read += *((volatile uint8_t *)(addr+(i<<2)+2));
        // data_read <<= 8;
        // data_read += *((volatile uint8_t *)(addr+(i<<2)+1));
        // data_read <<= 8;
        // data_read += *((volatile uint8_t *)(addr+(i<<2)+0));

        addr_tmp = (i << 2) + addr;
        data_read = BL_RD_WORD(addr_tmp);
        if((i % 2) == 0)
            data = data0 + i;
        else
            data = data1 + i;

        if (print_flag && i == 0){
            uhs_phy_printf("addr 0x%lx, write_val 0x%lx, read_val 0x%lx\r\n",addr_tmp,data,data_read);
        }
        if(data_read != data){
            array_read_pass = 0;
            uhs_phy_printf("addr 0x%lx, write_val 0x%lx, read_val error 0x%lx\r\n",addr_tmp,data,data_read);
            break;
        }
    }
    if (print_flag){
        uhs_phy_printf("BEFORE CACHE FUCNTION\r\n");
    }
    if (cache_state){
        // #if CACHE_EN
        __DSB();
        __ISB();
        L1C_DCache_Clean_Invalid_All();
        __DSB();
        __ISB();
        // #endif
    }
    uhs_phy_delay_us(10);
    if (print_flag){
        uhs_phy_printf("OUT_ARRAY_READ_FIX\r\n");
    }
    return array_read_pass;
}

void set_ck_dly_drv(uint32_t array_ck_dly_drv)
{
    uint32_t array_dqx_dly_drv = 0;
    uint32_t array_dqsx_dly_drv = 0;
    uint32_t array_cen_dly_drv = 0;

    uhs_phy_delay_us(10);  // ck modify need time

    array_dqx_dly_drv = (array_ck_dly_drv >=4) ? (array_ck_dly_drv-4) : 0;
    array_cen_dly_drv = array_dqx_dly_drv + 1;
    array_dqx_dly_drv = (array_dqx_dly_drv > 15) ? 15 : array_dqx_dly_drv;
    array_cen_dly_drv = (array_cen_dly_drv > 15) ? 15 : array_cen_dly_drv;
    array_dqsx_dly_drv = (array_dqsx_dly_drv > 15) ? 15 : array_dqsx_dly_drv;

    cfg_dq_drv(array_dqx_dly_drv);
    // cfg_dqs_drv(array_dqsx_dly_drv);
    cfg_ck_cen_drv(array_ck_dly_drv,array_cen_dly_drv);
    // uhs_phy_printf_debug("array_dqx_dly_drv= %ld,array_dqsx_dly_drv= %ld,array_ck_dly_drv= %ld,array_cen_dly_drv= %ld\r\n",array_dqx_dly_drv,array_dqsx_dly_drv,array_ck_dly_drv,array_cen_dly_drv); //debug
    // uhs_phy_delay_us(50); // ck modify need time
}

uint8_t array_read_latency_cal(void)
{
    // uint32_t tmpVal = 0;
    uint32_t uhs_latency = 42;
    // uint8_t array_ck_dly_drv_val[3] = {15,4,9};
    uint8_t array_ck_dly_drv_val[3] = {4,9,15};
    uint8_t ck_i;
    uint32_t array_ck_dly_drv = 0;
    int32_t i = 0;
    uint32_t array_dqs = 0;
    uint32_t array_dq = 0;
    uint32_t dqs_flag;
    uint32_t dq_flag;
    uint32_t len = 128;
    uint8_t rwindow = 0;

    for(uhs_latency = latency_wr[1]; uhs_latency > 0; uhs_latency --)
    {
        if(uhs_latency == 34)
        {
            array_read_err = 1;
            return uhs_err_handler(UHS_ARRAY_READ_LAT_ERR);
        }

        uhs_phy_printf_debug("array read cal by latency= %ld\r\n",uhs_latency);
        set_uhs_latency_r(uhs_latency);

        for (ck_i = 0; ck_i < (sizeof(array_ck_dly_drv_val)/sizeof(array_ck_dly_drv_val[0])); ck_i++){
            array_ck_dly_drv = array_ck_dly_drv_val[ck_i];
            set_ck_dly_drv(array_ck_dly_drv);
            uhs_phy_printf_debug("array read cal by ck= %ld\r\n",array_ck_dly_drv);

            rwindow = 0;

            // sweep dqs
            cfg_dq_rx(0);
            for(i = 15; i >= 0; i --)
            {
                cfg_dqs_rx(i);
                dqs_flag = array_read_fix(addr_rarray,len,data0_rarray,data1_rarray);
                if(dqs_flag == 1)
                {
                    uhs_phy_printf("array_read_dqs_dq_cal pass by --dqs= %ld\r\n",i);
                    array_dqs += i;
                    rwindow += i;
                    uhs_phy_cal_res->rwindow_end = i;
                    break;
                }
            }
            for(i = 0; i <= 15; i ++)
            {
                cfg_dqs_rx(i);
                dqs_flag = array_read_fix(addr_rarray,len,data0_rarray,data1_rarray);
                if(dqs_flag == 1)
                {
                    uhs_phy_printf("array_read_dqs_dq_cal pass by ++dqs= %ld\r\n",i);
                    array_dqs += i;
                    rwindow = (i > 0) ? (rwindow - i) : (rwindow + 1);
                    uhs_phy_cal_res->rwindow_begin = i;
                    break;
                }
            }
            // sweep dq
            cfg_dqs_rx(0);
            for(i = 15; i >= 0; i --)
            {
                cfg_dq_rx(i);
                dq_flag = array_read_fix(addr_rarray,len,data0_rarray,data1_rarray);
                if(dq_flag == 1)
                {
                    uhs_phy_printf("array_read_dqs_dq_cal pass by --dq= %ld\r\n",i);
                    array_dq += i;
                    rwindow += i;
                    break;
                }
            }
            for(i = 0; i <= 15; i ++)
            {
                cfg_dq_rx(i);
                dq_flag = array_read_fix(addr_rarray,len,data0_rarray,data1_rarray);
                if(dq_flag == 1)
                {
                    uhs_phy_printf("array_read_dqs_dq_cal pass by ++dq= %ld\r\n",i);
                    array_dq += i;
                    rwindow -= i;
                    break;
                }
            }

            if(dqs_flag == 1 || dq_flag == 1){
                if(array_dqs >= array_dq)
                {
                    array_dqs = (array_dqs-array_dq)/2;
                    array_dq = 0;
                }
                else
                {
                    #if CAL_MODE == 2
                    array_read_err = 2;
                    return uhs_err_handler(UHS_ARRAY_READ_LAT_ERR);
                    #endif
                    array_dq = (array_dq-array_dqs)/2;
                    array_dqs = 0;
                }
                cfg_dq_rx(array_dq);
                cfg_dqs_rx(array_dqs);
                uhs_phy_printf("array_read_dqs_dq_cal valid code number= %d\r\n",rwindow);
                uhs_phy_cal_res->rwindow = rwindow;
                uhs_phy_cal_res->rdqs = array_dqs;
                uhs_phy_cal_res->rdq = array_dq;
                uhs_phy_printf("array_read_dqs_dq_cal pass by array_dqs= %ld, array_dq= %ld\r\n",array_dqs,array_dq);
                break;
            }
        }
        if(dqs_flag == 1 || dq_flag == 1){
            uhs_phy_cal_res->rl = uhs_latency;
            uhs_phy_printf("array_read_latency_cal pass, latency= %ld, ck= %ld\r\n",uhs_latency,array_ck_dly_drv);
            break;
        }
    }

