RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
    return 0;
}

uint8_t array_write_ck_cal(void)
{
    uint32_t array_ck_dly_drv = 0;
    uint32_t array_ck_dly_drv1 = 15;
    uint32_t array_ck_dly_drv2 = 4;
    uint32_t flag_1 = 0;
    uint32_t flag_2 = 0;
    uint32_t len = 1024<<4;

    for(array_ck_dly_drv = 4; array_ck_dly_drv <= 15; array_ck_dly_drv ++)
    {
        set_ck_dly_drv(array_ck_dly_drv);
        flag_2 = array_read_fix(addr_rarray,len,data0_rarray,data1_rarray);
        if (flag_2 == 0){
            uhs_phy_printf("array_write_ck_cal ck++ = %ld, flag_2 = %ld\r\n",array_ck_dly_drv,flag_2);
        }
        if(flag_2 == 0 && flag_ck2 == 0){
            flag_ck2 = 1;
            uhs_phy_printf("array_write_ck_cal fail by ++ck= %ld\r\n",array_ck_dly_drv);
            array_ck_dly_drv2 = array_ck_dly_drv;
            // break;
        }
    }
    if (flag_ck2 == 1)
        flag_2 = 0;
    for(array_ck_dly_drv = 15; array_ck_dly_drv >= 4; array_ck_dly_drv --)
    {
        set_ck_dly_drv(array_ck_dly_drv);
        flag_1 = array_read_fix(addr_rarray,len,data0_rarray,data1_rarray);
        if (flag_1 == 0){
            uhs_phy_printf("array_write_ck_cal ck-- = %ld, flag_1 = %ld\r\n",array_ck_dly_drv,flag_1);
        }
        if(flag_1 == 0 && flag_ck1 == 0){
            flag_ck1 = 1;
            uhs_phy_printf("array_write_ck_cal fail by --ck= %ld\r\n",array_ck_dly_drv);
            array_ck_dly_drv1 = array_ck_dly_drv;
            // break;
        }
    }
    if (flag_ck1 == 1)
        flag_1 = 0;

    if (flag_1 == 0 && flag_2 == 0){
        if(array_ck_dly_drv1 == 15 && array_ck_dly_drv2 == 4)
        {
            return uhs_err_handler(UHS_ARRAY_WRITE_CK_ERR);
        }
        else if ((15 - array_ck_dly_drv1) >= (array_ck_dly_drv2 - 4)){
            array_ck_dly_drv = 15;
        }
        else{
            array_ck_dly_drv = 4;
        }
    }
    else if (flag_1 == 0 && flag_2 == 1){
        array_ck_dly_drv = (array_ck_dly_drv1 > 9) ? 4 : 15;
    }else if (flag_1 == 1 && flag_2 == 0){
        array_ck_dly_drv = (array_ck_dly_drv2 > 9) ? 4 : 15;
    }
    else {
        array_ck_dly_drv = (15 + 4) / 2;
    }

    set_ck_dly_drv(array_ck_dly_drv);
    uhs_phy_cal_res->ck = array_ck_dly_drv;
    uhs_phy_printf("array_write_ck_cal pass, ck= %ld\r\n",array_ck_dly_drv);

    return 0;
}

uint8_t array_read_dqs_dq_cal(void)
{
    int32_t i = 0;
    uint32_t array_dqs = 0;
    uint32_t array_dq = 0;
    uint32_t dqs_flag;
    uint32_t dq_flag;
    uint32_t len = 128;

    // sweep dqs
    cfg_dq_rx(0);

    for(i = 15; i >= 0; i --)
    {
        cfg_dqs_rx(i);
        dqs_flag = array_read_fix(addr_rarray,len,data0_rarray,data1_rarray);
        if(dqs_flag == 1)
        {
            uhs_phy_printf("array_read_dqs_dq_cal pass by dqs= %ld\r\n",i);
            array_dqs = i;
            break;
        }
    }
    // sweep dq
    cfg_dqs_rx(0);
    for(i = 15; i >=0; i --)
    {
        cfg_dq_rx(i);
        dq_flag = array_read_fix(addr_rarray,len,data0_rarray,data1_rarray);
        if(dq_flag == 1)
        {
            uhs_phy_printf("array_read_dqs_dq_cal pass by dq= %ld\r\n",i);
            array_dq = i;
            break;
        }
    }
    if(dqs_flag == 0 && dq_flag == 0)
    {
        return uhs_err_handler(UHS_ARRAY_READ_CAL_ERR);
    }
    if(array_dqs > array_dq)
    {
        array_dqs = (array_dqs-array_dq)/2;
        array_dq = 0;
    }
    else
    {
        array_dq = (array_dq-array_dqs)/2;
        array_dqs = 0;
    }
    cfg_dq_rx(array_dq);
    cfg_dqs_rx(array_dqs);
    uhs_phy_printf("array_read_dqs_dq_cal pass by array_dqs= %ld, array_dq= %ld\r\n",array_dqs,array_dq);

    return 0;
}

uint8_t array_write_dqs_dq_cal(void)
{
    uint32_t tmpVal = 0;
    int32_t i = 0;
    uint32_t dqs_flag1 = 0;
    uint32_t dqs_flag2 = 0;
    uint32_t array_dqs_dly_drv = 0;
    uint32_t array_dqs_dly_drv1 = 0;
    uint32_t array_dqs_dly_drv2 = 0;

    uint32_t addr = 0x50000000;
    uint32_t len = 128;
    uint32_t data0 = 0x23456789;
    uint32_t data1 = 0x98765432;

    uint8_t wwindow = 0;

    for(i = 15; i >= 0; i --)
    {
        cfg_dqs_drv(i);
        array_write_fix(addr,len,data0,data1);
        dqs_flag1 = array_read_fix(addr,len,data0,data1);
        if(dqs_flag1 == 1)
        {
            uhs_phy_printf("array_write_dqs_dq_cal pass by -- dqs1= %ld\r\n",i);
            array_dqs_dly_drv1 = i;
            uhs_phy_cal_res->wwindow_end = i;
            break;
        }
        else
        {
            uhs_phy_printf_debug("array_write_dqs_dq_cal fail by -- dqs1= %ld\r\n",i);
        }
    }
    for(i = 0; i <= 15; i ++)
    {
        cfg_dqs_drv(i);
        array_write_fix(addr,len,data1,data0);
        dqs_flag2 = array_read_fix(addr,len,data1,data0);
        if(dqs_flag2 == 1)
        {
            uhs_phy_printf("array_write_dqs_dq_cal pass by ++ dqs2= %ld\r\n",i);
            array_dqs_dly_drv2 = i;
            uhs_phy_cal_res->wwindow_begin = i;
            break;
        }
        else
        {
            uhs_phy_printf_debug("array_write_dqs_dq_cal fail by ++ dqs2= %ld\r\n",i);
        }
    }

    if(dqs_flag1 == 1 && dqs_flag2 == 1)
    {
        array_dqs_dly_drv = (array_dqs_dly_drv1 + array_dqs_dly_drv2) / 2 ;
    }
    else if(dqs_flag1 == 1 && dqs_flag2 == 0){
        array_dqs_dly_drv = array_dqs_dly_drv1;
    }else if(dqs_flag1 == 0 && dqs_flag2 == 1){
        array_dqs_dly_drv = array_dqs_dly_drv2;
    }else{
        return uhs_err_handler(UHS_ARRAY_WRITE_CAL_ERR);
    }

    //debug
    // array_dqs_dly_drv = 4;

    // if ck_dly_drv = 4, fix dqsx_dly_drv to 0
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_00);
    tmpVal = (tmpVal >> 16) & 0xF;
    if(tmpVal == 4){
        array_dqs_dly_drv = 0;
        uhs_phy_cal_res->wwindow_begin = 0;
    }
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_08);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal,PSRAM_UHS_DQ0_DLY_DRV);

    wwindow = (array_dqs_dly_drv > 0) ? (array_dqs_dly_drv1 - array_dqs_dly_drv2 + 1) : (array_dqs_dly_drv1 - 0 + 1);
    uhs_phy_printf("array_write_dqs_dq_cal valid code number= %d\r\n",wwindow);
    uhs_phy_cal_res->wwindow = wwindow;
    uhs_phy_cal_res->wdqs = array_dqs_dly_drv;
    uhs_phy_cal_res->wdq = tmpVal;
    uhs_phy_printf("array_write_dqs_dq_cal pass by array_dqs_dly_drv= %ld,array_dq_dly_drv= %ld\r\n",array_dqs_dly_drv,tmpVal);
    // set dqs by register write cal result
    cfg_dqs_drv(array_dqs_dly_drv);

