RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
    return 0;
}

BL_Err_Type ATTR_CLOCK_SECTION GLB_Config_UHS_PLL_Freq(GLB_XTAL_Type xtalType, uint32_t pllFreq)
{
    uint32_t xtalFreq = 0;
    uint32_t factor = 0;
    GLB_MU_PLL_CFG_BASIC_Type uhsPllMCfg = {
        .clkpllRefdivRatio = 1,         /*!< pll_refdiv_ratio */
        .clkpllSelSampleClk = 2,        /*!< pll_sel_sample_clk */
        .clkpllVcoSpeed = 7,            /*!< pll_vco_speed */
        .clkpllEvenDivEn = 1,           /*!< pll_even_div_en */
        .clkpllEvenDivRatio = 2100/50,  /*!< pll_even_div_ratio */
    };
    GLB_MU_PLL_Cfg_Type uhsPllCfg[GLB_XTAL_MAX] = {
        { NULL, 0x0 },          /*!< XTAL is None */
        { &uhsPllMCfg, 0x0 },   /*!< XTAL is 24M */
        { &uhsPllMCfg, 0x0 },   /*!< XTAL is 32M */
        { &uhsPllMCfg, 0x0 },   /*!< XTAL is 38.4M */
        { &uhsPllMCfg, 0x0 },   /*!< XTAL is 40M */
        { &uhsPllMCfg, 0x0 },   /*!< XTAL is 26M */
        { &uhsPllMCfg, 0x0 },   /*!< XTAL is RC32M */
    };
    GLB_PLL_REF_CLK_Type refClk;

    /* calc clkpllRefdivRatio */
    switch(xtalType){
        case GLB_XTAL_NONE:
            return ERROR;
        case GLB_XTAL_24M:
            xtalFreq = 240;
            uhsPllMCfg.clkpllRefdivRatio = 1;
            break;
        case GLB_XTAL_32M:
            xtalFreq = 320;
            uhsPllMCfg.clkpllRefdivRatio = 2;
            break;
        case GLB_XTAL_38P4M:
            xtalFreq = 384;
            uhsPllMCfg.clkpllRefdivRatio = 2;
            break;
        case GLB_XTAL_40M:
            xtalFreq = 400;
            uhsPllMCfg.clkpllRefdivRatio = 2;
            break;
        case GLB_XTAL_26M:
            xtalFreq = 260;
            uhsPllMCfg.clkpllRefdivRatio = 1;
            break;
        case GLB_XTAL_RC32M:
            xtalFreq = 320;
            uhsPllMCfg.clkpllRefdivRatio = 2;
            break;
        default :
            break;
    }
    /* calc clkpllSelSampleClk */
    factor = pllFreq*20480/(xtalFreq/uhsPllMCfg.clkpllRefdivRatio);
    if(factor<32*2048){
        uhsPllMCfg.clkpllSelSampleClk = 0;
    }else if(factor<64*2048){
        uhsPllMCfg.clkpllSelSampleClk = 1;
    }else if(factor<128*2048){
        uhsPllMCfg.clkpllSelSampleClk = 2;
    }else{
        uhsPllMCfg.clkpllSelSampleClk = 2;
    }
    /* calc clkpllVcoSpeed */
    if(pllFreq<800){
        uhsPllMCfg.clkpllVcoSpeed = 1;
    }else if(pllFreq<1000){
        uhsPllMCfg.clkpllVcoSpeed = 2;
    }else if(pllFreq<1200){
        uhsPllMCfg.clkpllVcoSpeed = 3;
    }else if(pllFreq<1500){
        uhsPllMCfg.clkpllVcoSpeed = 4;
    }else if(pllFreq<1700){
        uhsPllMCfg.clkpllVcoSpeed = 5;
    }else if(pllFreq<1900){
        uhsPllMCfg.clkpllVcoSpeed = 6;
    }else if(pllFreq<2200){
        uhsPllMCfg.clkpllVcoSpeed = 7;
    }else{
        uhsPllMCfg.clkpllVcoSpeed = 8;
    }
    /* calc clkpllEvenDivRatio */
    uhsPllMCfg.clkpllEvenDivRatio = pllFreq/50;
    /* calc clkpllSdmin */
    uhsPllCfg[GLB_XTAL_24M].clkpllSdmin = factor;
    uhsPllCfg[GLB_XTAL_32M].clkpllSdmin = factor;
    uhsPllCfg[GLB_XTAL_38P4M].clkpllSdmin = factor;
    uhsPllCfg[GLB_XTAL_40M].clkpllSdmin = factor;
    uhsPllCfg[GLB_XTAL_26M].clkpllSdmin = factor;
    uhsPllCfg[GLB_XTAL_RC32M].clkpllSdmin = factor;

    if (xtalType == GLB_XTAL_RC32M) {
        refClk = GLB_PLL_REFCLK_RC32M;
    } else {
        refClk = GLB_PLL_REFCLK_XTAL;
    }

    // GLB_Power_Off_MU_PLL(GLB_MU_PLL_UHSPLL);
    GLB_MU_PLL_Ref_Clk_Sel(GLB_MU_PLL_UHSPLL, refClk);
    GLB_Power_On_MU_PLL(GLB_MU_PLL_UHSPLL, &(uhsPllCfg[xtalType]), 1);

    return SUCCESS;
}

uint8_t init_reg_write(void){
    uint32_t tmpVal = 0;
    uint8_t wl_i;
    uint32_t wl;
    uint32_t wdqs;
    // uint8_t wdq_val[3] = {0,11,5};
    uint8_t wdq_val[3] = {0,5,11};
    uint8_t wdq_i;
    uint32_t wdq;
    uint32_t rl;
    uint32_t rdqs;
    uint32_t rdq;
    uint8_t rl_i;
    uint8_t wl_val_32[6] = {1,0,2,3,4,5};
    uint8_t rl_val_32[5] = {36,37,38,39,40};
    uint8_t wl_val_64[6] = {9,8,10,7,11,6};
    uint8_t rl_val_64[5] = {36,37,38,39,40};
    uint8_t wl_val[6];
    uint8_t rl_val[5];

    if (cfg_glb->psramMemSize == PSRAM_MEM_SIZE_32MB){
        for (wl_i = 0; wl_i < (sizeof(wl_val)/sizeof(wl_val[0])); wl_i++){
            wl_val[wl_i] = wl_val_32[wl_i];
        }
        for (rl_i = 0; rl_i < (sizeof(rl_val)/sizeof(rl_val[0])); rl_i++){
            rl_val[rl_i] = rl_val_32[rl_i];
        }
    }else if(cfg_glb->psramMemSize == PSRAM_MEM_SIZE_64MB){
        for (wl_i = 0; wl_i < (sizeof(wl_val)/sizeof(wl_val[0])); wl_i++){
            wl_val[wl_i] = wl_val_64[wl_i];
        }
        for (rl_i = 0; rl_i < (sizeof(rl_val)/sizeof(rl_val[0])); rl_i++){
            rl_val[rl_i] = rl_val_64[rl_i];
        }
    }

    // set to 2000Mbps
    for (rl_i = 0; rl_i < (sizeof(rl_val)/sizeof(rl_val[0])); rl_i++){
        rl = rl_val[rl_i];
        set_uhs_latency_r(rl);
        for (wl_i = 0; wl_i < (sizeof(wl_val)/sizeof(wl_val[0])); wl_i++){
            wl = wl_val[wl_i];
            latency_wr[0] = wl;
            set_uhs_latency_w(wl);
            for (wdq_i = 0; wdq_i < (sizeof(wdq_val)/sizeof(wdq_val[0])); wdq_i++){
                wdq = wdq_val[wdq_i];
                cfg_dq_drv(wdq);
                cfg_ck_cen_drv(wdq + 4,wdq + 1);
                for (wdqs = 0; wdqs <= 15; wdqs++){
                    cfg_dqs_drv(wdqs);
                    set_uhs_phy_init();
                    CHECK_ERR_FLAG(uhs_reg_w,(uhs_latency_code,2,0,0)); //uhs_latency_code==3,uhs_drive==2,ma==0,BL_32==0
                    set_uhs_phy();
                    rdq = 0;
                    cfg_dq_rx(rdq);
                    for (rdqs = 0; rdqs <= 15; rdqs++){
                        cfg_dqs_rx(rdqs);
                        CHECK_ERR_FLAG(uhs_reg_r,(0,1));
                        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
                        uhs_phy_printf_debug("PSRAM_UHS_UHS_CMD>>24 = 0x%lx, rdqs++\r\n",tmpVal);
                        if(tmpVal == ((2<<3)+uhs_latency_code)){
                            uhs_phy_printf("LATENCY_CODE_WRITE_SUCCESS, wl = %ld, wdqs = %ld, wdq = %ld, rl = %ld, rdqs = %ld, rdq = %ld\r\n",wl,wdqs,wdq,rl,rdqs,rdq);
                            return 0;
                        }
                        else{
                            uhs_phy_printf_debug("LATENCY_CODE_WRITE_FAIL, wl = %ld, wdqs = %ld, wdq = %ld, rl = %ld, rdqs = %ld, rdq = %ld\r\n",wl,wdqs,wdq,rl,rdqs,rdq);
                        }
                    }
                    rdqs = 0;
                    cfg_dqs_rx(rdqs);
                    for (rdq = 0; rdq <= 15; rdq++){
                        cfg_dq_rx(rdq);
                        CHECK_ERR_FLAG(uhs_reg_r,(0,1));
                        tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
                        uhs_phy_printf_debug("PSRAM_UHS_UHS_CMD>>24 = 0x%lx, rdq++\r\n",tmpVal);
                        if(tmpVal == ((2<<3)+uhs_latency_code)){
                            uhs_phy_printf("LATENCY_CODE_WRITE_SUCCESS, wl = %ld, wdqs = %ld, wdq = %ld, rl = %ld, rdqs = %ld, rdq = %ld\r\n",wl,wdqs,wdq,rl,rdqs,rdq);
                            return 0;
                        }
                        else{
                            uhs_phy_printf_debug("LATENCY_CODE_WRITE_FAIL, wl = %ld, wdqs = %ld, wdq = %ld, rl = %ld, rdqs = %ld, rdq = %ld\r\n",wl,wdqs,wdq,rl,rdqs,rdq);
                        }
                    }
                }
            }
        }
    }
    return uhs_err_handler(UHS_LATENCY_CODE_WRITE_ERR);
}

