RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
uint8_t init_array_write(void){
    uint8_t wl_val[6] = {13,12,14,11,15,10};
    uint8_t wl_i;
    uint32_t wl;
    uint32_t wdqs;
    // uint8_t wdq_val[3] = {0,11,5};
    uint8_t wdq_val[3] = {0,5,11};
    uint8_t wdq_i;
    uint32_t wdq;
    uint32_t rl;
    uint32_t rdqs;
    uint32_t rdq;
    uint32_t len = 1024<<4;
    uint32_t flag = 0;
    print_flag = 1;

    for (wl_i = 0; wl_i < (sizeof(wl_val)/sizeof(wl_val[0])); wl_i++){
        wl = wl_val[wl_i];
        latency_wr[0] = wl;
        set_uhs_latency_w(wl);
        for (wdq_i = 0; wdq_i < (sizeof(wdq_val)/sizeof(wdq_val[0])); wdq_i++){
            wdq = wdq_val[wdq_i];
            cfg_dq_drv(wdq);
            cfg_ck_cen_drv(wdq + 4,wdq + 1);
            for (wdqs = 0; wdqs <= 15; wdqs++){
                cfg_dqs_drv(wdqs);
                array_write_fix(addr_rarray,len,data0_rarray,data1_rarray);
                for (rl = latency_wr[1]; rl >= 35; rl--){
                    set_uhs_latency_r(rl);
                    rdq = 0;
                    cfg_dq_rx(rdq);
                    for (rdqs = 0; rdqs <= 15; rdqs++){
                        cfg_dqs_rx(rdqs);
                        flag = array_read_fix(addr_rarray,len,data0_rarray,data1_rarray);
                        if(flag == 1){
                            uhs_phy_printf("INIT_ARRAY_WRITE_SUCCESS, rdqs++, wl = %ld, wdqs = %ld, wdq = %ld, rl = %ld, rdqs = %ld, rdq = %ld\r\n",wl,wdqs,wdq,rl,rdqs,rdq);
                            print_flag = 0;
                            #if CAL_MODE == 2
                            if(wl != 13){
                                init_array_write_err = 2;
                                return uhs_err_handler(UHS_INIT_ARRAY_WRITE_ERR);
                            }
                            #endif
                            uhs_phy_cal_res->wl = wl;
                            return 0;
                        }
                        else{
                            uhs_phy_printf_debug("INIT_ARRAY_WRITE_FAIL, rdqs++, wl = %ld, wdqs = %ld, wdq = %ld, rl = %ld, rdqs = %ld, rdq = %ld\r\n",wl,wdqs,wdq,rl,rdqs,rdq);
                        }
                    }
                    rdqs = 0;
                    cfg_dqs_rx(rdqs);
                    for (rdq = 0; rdq <= 15; rdq++){
                        cfg_dq_rx(rdq);
                        flag = array_read_fix(addr_rarray,len,data0_rarray,data1_rarray);
                        if(flag == 1){
                            uhs_phy_printf("INIT_ARRAY_WRITE_SUCCESS, rdq++, wl = %ld, wdqs = %ld, wdq = %ld, rl = %ld, rdqs = %ld, rdq = %ld\r\n",wl,wdqs,wdq,rl,rdqs,rdq);
                            print_flag = 0;
                            #if CAL_MODE == 2
                            if(wl != 13){
                                init_array_write_err = 2;
                                return uhs_err_handler(UHS_INIT_ARRAY_WRITE_ERR);
                            }
                            #endif
                            uhs_phy_cal_res->wl = wl;
                            return 0;
                        }
                        else{
                            uhs_phy_printf_debug("INIT_ARRAY_WRITE_FAIL, rdq++, wl = %ld, wdqs = %ld, wdq = %ld, rl = %ld, rdqs = %ld, rdq = %ld\r\n",wl,wdqs,wdq,rl,rdqs,rdq);
                        }
                    }
                }
            }
        }
    }
    init_array_write_err = 1;
    return uhs_err_handler(UHS_INIT_ARRAY_WRITE_ERR);
}

void set_odt_en(void){
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_RSVD_REG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_MR2_2_0,0x3);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_RSVD_REG,tmpVal);

    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_MODE_REG,0x2); //reg_mode_reg
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_CONFIG_REQ,0x1);  //reg_config_req
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);
    uhs_phy_delay_us(10);

    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_REGW_PULSE,0x1);  //reg_regw_pulse
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD,tmpVal);
    uhs_phy_delay_us(10);

    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_REG_CONFIG_REQ,0x0);  //reg_config_req
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_BASIC,tmpVal);

    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_ODT_SEL,0xf);  // odt_sel
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_30,tmpVal);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_4C);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_ODT_SEL_HW,0x1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,PSRAM_UHS_ODT_SEL_DLY,0x3);
    BL_WR_REG(PSRAM_UHS_BASE,PSRAM_UHS_PHY_CFG_4C,tmpVal);
}

uint8_t init_reg_write_2kM(void){
    uint32_t tmpVal = 0;
    uint8_t wl_val[6] = {13,12,14,11,15,10};
    uint8_t wl_i;
    uint32_t wl;
    uint32_t wdqs;
    // uint8_t wdq_val[3] = {0,11,5};
    uint8_t wdq_val[3] = {0,5,11};
    uint8_t wdq_i;
    uint32_t wdq;

    // set to 2000Mbps
    for (wl_i = 0; wl_i < (sizeof(wl_val)/sizeof(wl_val[0])); wl_i++){
        wl = wl_val[wl_i];
        latency_wr[0] = wl;
        set_uhs_latency_w(wl);
        for (wdq_i = 0; wdq_i < (sizeof(wdq_val)/sizeof(wdq_val[0])); wdq_i++){
            wdq = wdq_val[wdq_i];
            cfg_dq_drv(wdq);
            cfg_ck_cen_drv(wdq + 4,wdq + 1);
            for (wdqs = 0; wdqs <= 15; wdqs++){
                cfg_dqs_drv(wdqs);
                set_odt_en();
                CHECK_ERR_FLAG(uhs_reg_r,(2,0));
                tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
                uhs_phy_printf_debug("MA2 = 0x%lx\r\n",tmpVal);
                if(tmpVal == 3){
                    uhs_phy_printf("2kM_REG_WRITE_SUCCESS, wl = %ld, wdqs = %ld, wdq = %ld\r\n",wl,wdqs,wdq);
                    return 0;
                }
                else{
                    uhs_phy_printf_debug("2kM_REG_WRITE_FAIL, wl = %ld, wdqs = %ld, wdq = %ld\r\n",wl,wdqs,wdq);
                }
            }
        }
    }
    return uhs_err_handler(UHS_REG_WRITE_2kM_ERR);
}

