RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
uint8_t self_cal()
{
    uint32_t tmpVal = 0;
    uint32_t datarate;
    datarate = cfg_glb->pck_freq;

    if (datarate >= 933*2){
        uhs_latency_code = UHS_LATENCY_CODE_1066;
    }else if(datarate >= 800*2){
        uhs_latency_code = UHS_LATENCY_CODE_933;
    }else if(datarate >= 533*2){
        uhs_latency_code = UHS_LATENCY_CODE_800;
    }else if(datarate >= 400*2){
        uhs_latency_code = UHS_LATENCY_CODE_533;
    }else if(datarate >= 333*2){
        uhs_latency_code = UHS_LATENCY_CODE_400;
    }else if(datarate >= 200*2){
        uhs_latency_code = UHS_LATENCY_CODE_333;
    }else{
        uhs_latency_code = UHS_LATENCY_CODE_200;
    }
    // #if PSRAM_32MB
    // PSRAM_UHS_Cfg_Type psramCfg = {
    //     datarate,
    //     PSRAM_MEM_SIZE_32MB,
    //     PSRAM_PAGE_SIZE_2KB,
    //     0,
    // };
    // #else
    // PSRAM_UHS_Cfg_Type psramCfg = {
    //     datarate,
    //     PSRAM_MEM_SIZE_64MB,
    //     PSRAM_PAGE_SIZE_2KB,
    //     0,
    // };
    // #endif

    uhs_phy_printf("********** INIT_REG_WRITE **********\r\n");
    CHECK_ERR_FLAG(init_reg_write,()); //write latency code
    // uhs_phy_printf("START_CAL_AT %ldMbps\r\n",datarate);
    // datarate_glb = datarate;
    // ramsize_glb = cfg->psramMemSize;
    GLB_Config_UHS_PLL_Freq(GLB_XTAL_40M,datarate);
    Psram_UHS_Init_Override(cfg_glb); //controller init
    set_uhs_phy();

    #if CAL_MODE == 0
    return 0;
    // then load efuse, to set uhs phy regs
    // call set_odt_en(), to set psram odt MR if need
    // call mr_read_back()
    #endif

    uhs_phy_printf("********** REG_READ_CAL **********\r\n");
    // uhs_phy_reg_dump();
    // ******register read latency & dqs & dq calibration
    CHECK_ERR_FLAG(reg_read_cal,());
    if (cal_done_flag == 1)
        return 0;
    // if (datarate >= 1800){
    //     latency_wr[1] = 39;
    // }else if(datarate >= 1600){
    //     latency_wr[1] = 38;
    // }else if(datarate >= 1100){
    //     latency_wr[1] = 37;
    // }else{
    //     latency_wr[1] = 36;
    // }

    CHECK_ERR_FLAG(uhs_reg_r,(1,0));
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
    if (cfg_glb->psramMemSize == PSRAM_MEM_SIZE_32MB){
        tmpVal &= 0x10;
    }else if (cfg_glb->psramMemSize == PSRAM_MEM_SIZE_64MB){
        tmpVal &= 0x20;
    }
    if (tmpVal != 0){
        return uhs_err_handler(UHS_BAD_DIE_ERR);
    }

    uhs_phy_printf("UHS_PHY_CAL, ODT_EN = %d\r\n",ODT_EN);
    #if ODT_EN
    uhs_phy_printf("********** INIT_REG_WRITE_2kM **********\r\n");
    CHECK_ERR_FLAG(init_reg_write_2kM,());
    #endif

    uhs_phy_printf("********** INIT_ARRAY_WRITE **********\r\n");
    #if bl808_DBG_RF == 2
    uhs_phy_reg_dump();
    #endif
    // reg_write_cal();
    CHECK_ERR_FLAG(init_array_write,());
    uhs_phy_printf("********** ARRAY_READ_CAL **********\r\n");
    // uhs_phy_reg_dump();
    // ******array read latency & dqs & dq calibration
    CHECK_ERR_FLAG(array_read_latency_cal,());
    uhs_phy_printf("********** ARRAY_WRITE_CK_CAL **********\r\n");
    // uhs_phy_reg_dump();
    flag_ck1 = 0;
    flag_ck2 = 0;
    CHECK_ERR_FLAG(array_write_ck_cal,());
    uhs_phy_printf("********** ARRAY_WRITE_CAL **********\r\n");
    // uhs_phy_reg_dump();
    // array_read_dqs_dq_cal();  //calibrated in array_read_latency_cal
    CHECK_ERR_FLAG(array_write_dqs_dq_cal,());
    // uhs_phy_reg_dump();

    return 0;
}

void soft_reset(void)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(GLB_BASE,GLB_SWRST_CFG2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,GLB_REG_CTRL_PWRON_RST,0x1); // soft power on reset
    BL_WR_REG(GLB_BASE,GLB_SWRST_CFG2,tmpVal);
    uhs_phy_delay_ms(1);
}

uint8_t uhs_diagonal_test(uint32_t data0,uint32_t data1)
{
    uint32_t RA = 0x0; //X_address
    uint32_t CA = 0x0; //Y_address
    uint32_t CA_init = 0x0;
    uint32_t dataTmp;
    uint32_t STRESS_TEST_BASE = 0x50000000;
    uint32_t RowAddr = 0x3fff; //256Mb X_address

    if (cfg_glb->psramMemSize == PSRAM_MEM_SIZE_32MB){
        RowAddr = 0x3fff;
    }else if (cfg_glb->psramMemSize == PSRAM_MEM_SIZE_64MB){
        RowAddr = 0x7fff;
    }

    // data0
    for (RA = 0x0; RA <= RowAddr; RA++){
        STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFC0007FF;
        STRESS_TEST_BASE = STRESS_TEST_BASE | (RA<<11); // STRESS_TEST_BASE[25:11] = RA[14:0]
        CA_init = (RA & 0x7f) << 3;
        for (CA = CA_init; CA <= CA_init + 0x7; CA = CA + 2){
            STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFFFFF800;
            STRESS_TEST_BASE = STRESS_TEST_BASE | (CA<<1); // STRESS_TEST_BASE[10:2] = CA[9:1], STRESS_TEST_BASE[1:0] = 0;
            *((volatile uint32_t*)(STRESS_TEST_BASE)) = data0;
        }
    }
    for (RA = 0x0; RA <= RowAddr; RA++){
        STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFC0007FF;
        STRESS_TEST_BASE = STRESS_TEST_BASE | (RA<<11); // STRESS_TEST_BASE[25:11] = RA[14:0]
        CA_init = (RA & 0x7f) << 3;
        for (CA = CA_init; CA <= CA_init + 0x7; CA = CA + 2){
            STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFFFFF800;
            STRESS_TEST_BASE = STRESS_TEST_BASE | (CA<<1); // STRESS_TEST_BASE[10:2] = CA[9:1], STRESS_TEST_BASE[1:0] = 0;
            dataTmp = *((volatile uint32_t*)(STRESS_TEST_BASE));
            if(dataTmp != data0){
                uhs_phy_printfe("addr: 0x%lx\r\n", STRESS_TEST_BASE);
                uhs_phy_printfe("data_w data0: 0x%lx\r\n", data0);
                uhs_phy_printfe("addr_r data0: 0x%lx\r\n", dataTmp);
                return uhs_err_handler(UHS_DIAGONAL_TEST_ERR);
            }
        }
    }
    // data1
    for (RA = 0x0; RA <= RowAddr; RA++){
        STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFC0007FF;
        STRESS_TEST_BASE = STRESS_TEST_BASE | (RA<<11); // STRESS_TEST_BASE[25:11] = RA[14:0]
        CA_init = (RA & 0x7f) << 3;
        for (CA = CA_init; CA <= CA_init + 0x7; CA = CA + 2){
            STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFFFFF800;
            STRESS_TEST_BASE = STRESS_TEST_BASE | (CA<<1); // STRESS_TEST_BASE[10:2] = CA[9:1], STRESS_TEST_BASE[1:0] = 0;
            *((volatile uint32_t*)(STRESS_TEST_BASE)) = data1;
        }
    }
    for (RA = 0x0; RA <= RowAddr; RA++){
        STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFC0007FF;
        STRESS_TEST_BASE = STRESS_TEST_BASE | (RA<<11); // STRESS_TEST_BASE[25:11] = RA[14:0]
        CA_init = (RA & 0x7f) << 3;
        for (CA = CA_init; CA <= CA_init + 0x7; CA = CA + 2){
            STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFFFFF800;
            STRESS_TEST_BASE = STRESS_TEST_BASE | (CA<<1); // STRESS_TEST_BASE[10:2] = CA[9:1], STRESS_TEST_BASE[1:0] = 0;
            dataTmp = *((volatile uint32_t*)(STRESS_TEST_BASE));
            if(dataTmp != data1){
                uhs_phy_printfe("addr: 0x%lx\r\n", STRESS_TEST_BASE);
                uhs_phy_printfe("data_w data1: 0x%lx\r\n", data1);
                uhs_phy_printfe("addr_r data1: 0x%lx\r\n", dataTmp);
                return uhs_err_handler(UHS_DIAGONAL_TEST_ERR);
            }
        }
    }

