RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
    uhs_phy_printf("uhs_diagonal_test success\r\n");
    return 0;
}

uint8_t uhs_all_addr_test(void)
{
    int32_t RA = 0x0; //X_address
    int32_t CA = 0x0; //Y_address
    uint32_t dataTmp;
    uint32_t STRESS_TEST_BASE = 0x50000000;
    uint32_t RowAddr = 0x3fff; //256Mb X_address
    uint32_t data0 = 0xffffffff;
    uint32_t data1 = 0x00000000;

    if (cfg_glb->psramMemSize == PSRAM_MEM_SIZE_32MB){
        RowAddr = 0x3fff;
    }else if (cfg_glb->psramMemSize == PSRAM_MEM_SIZE_64MB){
        RowAddr = 0x7fff;
    }

    // ****** Y_address -> X_address
    //data0
    for (RA = 0x0; RA <= RowAddr; RA++){
        STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFC0007FF;
        STRESS_TEST_BASE = STRESS_TEST_BASE | (RA<<11); // STRESS_TEST_BASE[25:11] = RA[14:0]
        for (CA = 0x0; CA <= 0x3ff; CA = CA + 2){
            STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFFFFF800;
            STRESS_TEST_BASE = STRESS_TEST_BASE | (CA<<1); // STRESS_TEST_BASE[10:2] = CA[9:1], STRESS_TEST_BASE[1:0] = 0;
            *((volatile uint32_t*)(STRESS_TEST_BASE)) = data0;
        }
    }
    for (RA = 0x0; RA <= RowAddr; RA++){
        STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFC0007FF;
        STRESS_TEST_BASE = STRESS_TEST_BASE | (RA<<11); // STRESS_TEST_BASE[25:11] = RA[14:0]
        for(CA = 0x0; CA <= 0x3ff; CA = CA + 2){
            STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFFFFF800;
            STRESS_TEST_BASE = STRESS_TEST_BASE | (CA<<1); // STRESS_TEST_BASE[10:2] = CA[9:1], STRESS_TEST_BASE[1:0] = 0;
            dataTmp = *((volatile uint32_t*)(STRESS_TEST_BASE));
            if(dataTmp != data0){
                uhs_phy_printfe("addr: 0x%lx\r\n", STRESS_TEST_BASE);
                uhs_phy_printfe("data_w data0 first: 0x%lx\r\n", data0);
                uhs_phy_printfe("addr_r data0 first: 0x%lx\r\n", dataTmp);
                return uhs_err_handler(UHS_ALL_ADDR_TEST_ERR);
            }
        }
    }
    // data1
    for (RA = 0x0; RA <= RowAddr; RA++){
        STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFC0007FF;
        STRESS_TEST_BASE = STRESS_TEST_BASE | (RA<<11); // STRESS_TEST_BASE[25:11] = RA[14:0]
        for (CA = 0x0; CA <= 0x3ff; CA = CA + 2){
            STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFFFFF800;
            STRESS_TEST_BASE = STRESS_TEST_BASE | (CA<<1); // STRESS_TEST_BASE[10:2] = CA[9:1], STRESS_TEST_BASE[1:0] = 0;
            *((volatile uint32_t*)(STRESS_TEST_BASE)) = data1;
        }
    }
    // ****** X_address -> Y_address
    // data1
    for (RA = RowAddr; RA >= 0x0; RA--){
        STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFC0007FF;
        STRESS_TEST_BASE = STRESS_TEST_BASE | (RA<<11); // STRESS_TEST_BASE[25:11] = RA[14:0]
        for(CA = 0x3ff - 1; CA >= 0x0; CA = CA - 2){
            STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFFFFF800;
            STRESS_TEST_BASE = STRESS_TEST_BASE | (CA<<1); // STRESS_TEST_BASE[10:2] = CA[9:1], STRESS_TEST_BASE[1:0] = 0;
            dataTmp = *((volatile uint32_t*)(STRESS_TEST_BASE));
            if(dataTmp != data1){
                uhs_phy_printfe("addr: 0x%lx\r\n", STRESS_TEST_BASE);
                uhs_phy_printfe("data_w data1: 0x%lx\r\n", data1);
                uhs_phy_printfe("addr_r data1: 0x%lx\r\n", dataTmp);
                return uhs_err_handler(UHS_ALL_ADDR_TEST_ERR);
            }
        }
    }
    //data0
    for (RA = RowAddr; RA >= 0x0; RA--){
        STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFC0007FF;
        STRESS_TEST_BASE = STRESS_TEST_BASE | (RA<<11); // STRESS_TEST_BASE[25:11] = RA[14:0]
        for (CA = 0x3ff - 1; CA >= 0x0; CA = CA - 2){
            STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFFFFF800;
            STRESS_TEST_BASE = STRESS_TEST_BASE | (CA<<1); // STRESS_TEST_BASE[10:2] = CA[9:1], STRESS_TEST_BASE[1:0] = 0;
            *((volatile uint32_t*)(STRESS_TEST_BASE)) = data0;
        }
    }
    for (RA = RowAddr; RA >= 0x0; RA--){
        STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFC0007FF;
        STRESS_TEST_BASE = STRESS_TEST_BASE | (RA<<11); // STRESS_TEST_BASE[25:11] = RA[14:0]
        for(CA = 0x3ff - 1; CA >= 0x0; CA = CA - 2){
            STRESS_TEST_BASE = STRESS_TEST_BASE & 0xFFFFF800;
            STRESS_TEST_BASE = STRESS_TEST_BASE | (CA<<1); // STRESS_TEST_BASE[10:2] = CA[9:1], STRESS_TEST_BASE[1:0] = 0;
            dataTmp = *((volatile uint32_t*)(STRESS_TEST_BASE));
            if(dataTmp != data0){
                uhs_phy_printfe("addr: 0x%lx\r\n", STRESS_TEST_BASE);
                uhs_phy_printfe("data_w data0 second: 0x%lx\r\n", data0);
                uhs_phy_printfe("addr_r data0 second: 0x%lx\r\n", dataTmp);
                return uhs_err_handler(UHS_ALL_ADDR_TEST_ERR);
            }
        }
    }
    uhs_phy_printf("uhs_all_addr_test success\r\n");
    return 0;
}


void dump_uhs_phy_cal_res(void)
{
    #if CAL_MODE != 2
    // dump uhs_phy_cal_res
    uhs_phy_printf("uhs_phy_cal_res->cal_mode = %d\r\n",uhs_phy_cal_res->cal_mode);
    uhs_phy_printf("uhs_phy_cal_res->err_type = %d\r\n",uhs_phy_cal_res->err_type);
    uhs_phy_printf("uhs_phy_cal_res->err_sub_type = %d\r\n",uhs_phy_cal_res->err_sub_type);
    uhs_phy_printf("uhs_phy_cal_res->datarate = %d\r\n",uhs_phy_cal_res->datarate);
    uhs_phy_printf("uhs_phy_cal_res->rl = %d\r\n",uhs_phy_cal_res->rl);
    uhs_phy_printf("uhs_phy_cal_res->rdqs = %d\r\n",uhs_phy_cal_res->rdqs);
    uhs_phy_printf("uhs_phy_cal_res->rdq = %d\r\n",uhs_phy_cal_res->rdq);
    uhs_phy_printf("uhs_phy_cal_res->rwindow = %d\r\n",uhs_phy_cal_res->rwindow);
    uhs_phy_printf("uhs_phy_cal_res->rwindow_begin = %d\r\n",uhs_phy_cal_res->rwindow_begin);
    uhs_phy_printf("uhs_phy_cal_res->rwindow_end = %d\r\n",uhs_phy_cal_res->rwindow_end);
    uhs_phy_printf("uhs_phy_cal_res->ck = %d\r\n",uhs_phy_cal_res->ck);
    uhs_phy_printf("uhs_phy_cal_res->wl = %d\r\n",uhs_phy_cal_res->wl);
    uhs_phy_printf("uhs_phy_cal_res->wdqs = %d\r\n",uhs_phy_cal_res->wdqs);
    uhs_phy_printf("uhs_phy_cal_res->wdq = %d\r\n",uhs_phy_cal_res->wdq);
    uhs_phy_printf("uhs_phy_cal_res->wwindow = %d\r\n",uhs_phy_cal_res->wwindow);
    uhs_phy_printf("uhs_phy_cal_res->wwindow_begin = %d\r\n",uhs_phy_cal_res->wwindow_begin);
    uhs_phy_printf("uhs_phy_cal_res->wwindow_end = %d\r\n",uhs_phy_cal_res->wwindow_end);
    uhs_phy_printf("uhs_phy_cal_res->cal_done = %d\r\n",uhs_phy_cal_res->cal_done);
    uhs_phy_printf("uhs_phy_cal_res->crc_res = %lx\r\n",uhs_phy_cal_res->crc_res);
    #else
    // dump uhs_phy_cal_res
    uhs_phy_printf("uhs_phy_cal_res->cal_mode = %ld\r\n",uhs_phy_cal_res->cal_mode);
    uhs_phy_printf("uhs_phy_cal_res->err_type = %lx\r\n",uhs_phy_cal_res->err_type);
    uhs_phy_printf("uhs_phy_cal_res->err_sub_type = %ld\r\n",uhs_phy_cal_res->err_sub_type);
    uhs_phy_printf("uhs_phy_cal_res->datarate = %ld\r\n",uhs_phy_cal_res->datarate);
    uhs_phy_printf("uhs_phy_cal_res->rl = %ld\r\n",uhs_phy_cal_res->rl);
    uhs_phy_printf("uhs_phy_cal_res->rdqs = %ld\r\n",uhs_phy_cal_res->rdqs);
    uhs_phy_printf("uhs_phy_cal_res->rdq = %ld\r\n",uhs_phy_cal_res->rdq);
    uhs_phy_printf("uhs_phy_cal_res->rwindow = %ld\r\n",uhs_phy_cal_res->rwindow);
    uhs_phy_printf("uhs_phy_cal_res->rwindow_begin = %ld\r\n",uhs_phy_cal_res->rwindow_begin);
    uhs_phy_printf("uhs_phy_cal_res->rwindow_end = %ld\r\n",uhs_phy_cal_res->rwindow_end);
    uhs_phy_printf("uhs_phy_cal_res->ck = %ld\r\n",uhs_phy_cal_res->ck);
    uhs_phy_printf("uhs_phy_cal_res->wl = %ld\r\n",uhs_phy_cal_res->wl);
    uhs_phy_printf("uhs_phy_cal_res->wdqs = %ld\r\n",uhs_phy_cal_res->wdqs);
    uhs_phy_printf("uhs_phy_cal_res->wdq = %ld\r\n",uhs_phy_cal_res->wdq);
    uhs_phy_printf("uhs_phy_cal_res->wwindow = %ld\r\n",uhs_phy_cal_res->wwindow);
    uhs_phy_printf("uhs_phy_cal_res->wwindow_begin = %ld\r\n",uhs_phy_cal_res->wwindow_begin);
    uhs_phy_printf("uhs_phy_cal_res->wwindow_end = %ld\r\n",uhs_phy_cal_res->wwindow_end);
    uhs_phy_printf("uhs_phy_cal_res->cal_done = %lx\r\n",uhs_phy_cal_res->cal_done);
    uhs_phy_printf("uhs_phy_cal_res->crc_res = %lx\r\n",uhs_phy_cal_res->crc_res);
    #endif
}

