RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/src/bl808_uhs_phy.c
void uhs_phy_init(PSRAM_UHS_Cfg_Type *cfg)
{
    memset((void*)uhs_phy_cal_res, 0, sizeof(uhs_phy_cal_res_struct));
    uhs_phy_cal_res->cal_mode = CAL_MODE;
    uhs_phy_cal_res->datarate = cfg->pck_freq;

    err_flag = 0;

    __DSB();
    __ISB();
    cache_state = __get_MHCR();
    cache_state &= (0x1<<1);
    __DSB();
    __ISB();

    cfg_glb = cfg;
    latency_wr_2kM[1] = 41;
    uhs_phy_init_core(cfg);
}

extern uint32_t ATTR_TCM_SECTION BFLB_Soft_CRC32(void *dataIn, uint32_t len);
uint8_t uhs_phy_init_core(PSRAM_UHS_Cfg_Type *cfg)
{
    cal_done_flag = 0;
    if(latency_wr_2kM[1] == 34)
    {
        reg_read_err = 3;
        return uhs_err_handler(UHS_REG_READ_CAL_ERR);
    }

    uint32_t pck_freq_temp;

    uhs_phy_printf_debug("uhs phy init\r\n");
    if (cfg->psramMemSize == PSRAM_MEM_SIZE_32MB){
        uhs_phy_printf("\r\n########## START_CAL_AT %ldMbps, PSRAM_MEM_SIZE_32MB, CACHE_EN = %ld ##########\r\n",cfg->pck_freq,cache_state);
    }else if(cfg->psramMemSize == PSRAM_MEM_SIZE_64MB){
        uhs_phy_printf("\r\n########## START_CAL_AT %ldMbps, PSRAM_MEM_SIZE_64MB, CACHE_EN = %ld ##########\r\n",cfg->pck_freq,cache_state);
    }
    #if CAL_MODE != 2
        uhs_phy_printf("CAL_MODE = %d\r\n",uhs_phy_cal_res->cal_mode);
    #else
        uhs_phy_printf("CAL_MODE = %ld\r\n",uhs_phy_cal_res->cal_mode);
    #endif

    power_up_mm(0);
    power_up_uhspll();

    power_up_ldo12uhs();
    set_cen_ck_ckn();

    set_or_uhs();
    switch_to_ldo12uhs();
    release_cen_ck_ckn();

    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(GLB_BASE,GLB_UHS_PLL_CFG9);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,GLB_UHSPLL_SSC_EN,0x0); // uhspll_ssc_en
    BL_WR_REG(GLB_BASE,GLB_UHS_PLL_CFG9,tmpVal);
    pck_freq_temp = cfg->pck_freq;
    if (cfg->psramMemSize == PSRAM_MEM_SIZE_32MB){
        cfg->pck_freq = 800;
        // PSRAM_UHS_Cfg_Type psramCfg = {
        //     800,
        //     PSRAM_MEM_SIZE_32MB,
        //     PSRAM_PAGE_SIZE_2KB,
        //     0,
        // };

        GLB_Config_UHS_PLL_Freq(GLB_XTAL_40M,800);    //stuck
        Psram_UHS_Init_Override(cfg);  // controller init
        set_uhs_phy_init();         // phy init
        set_uhs_latency_w(1);
        set_uhs_latency_r(17);
        psram_init();               // psram init after set freq & set_phy

        // uhs_reg_r(0,1);
        // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
        // uhs_phy_printf_debug("readout MA0 = 0x%lx\r\n",tmpVal);
        // if(tmpVal == ((2<<3)+5))    // 700M --> default uhs_latency_code == 5
        // {
        //     uhs_phy_printf_debug("register read pass at 700Mbps\r\n");
        // }
        // else{
        //     uhs_phy_printf_debug("register read fail at 700Mbps\r\n");
        // }
    }
    else if(cfg->psramMemSize == PSRAM_MEM_SIZE_64MB){
        cfg->pck_freq = 1400;
        // PSRAM_UHS_Cfg_Type psramCfg = {
        //     1400,
        //     PSRAM_MEM_SIZE_64MB,
        //     PSRAM_PAGE_SIZE_2KB,
        //     0,
        // };

        GLB_Config_UHS_PLL_Freq(GLB_XTAL_40M,1400);    //stuck
        Psram_UHS_Init_Override(cfg);  // controller init
        set_uhs_phy_init();         // phy init
        set_uhs_latency_w(9);
        set_uhs_latency_r(30);
        psram_init();               // psram init after set freq & set_phy

        // uhs_reg_r(0,1);
        // tmpVal = BL_RD_REG(PSRAM_UHS_BASE,PSRAM_UHS_UHS_CMD)>>24;
        // if(tmpVal == ((2<<3)+1))    // 1400M --> default uhs_latency_code == 1
        // {
        //     uhs_phy_printf_debug("register read pass at 1400Mbps\r\n");
        // }
        // else{
        //     uhs_phy_printf_debug("register read fail at 1400Mbps\r\n");
        // }
    }

    cfg->pck_freq = pck_freq_temp;
    self_cal();
    uhs_phy_delay_ms(1);
    cal_done_flag = 1;
    #if CAL_MODE == 2
    if(err_flag == 0){
        uhs_phy_printf("********** UHS_DIAGONAL_TEST **********\r\n");
        uhs_diagonal_test(0x5555aaaa,0xaaaa5555);
        // uhs_phy_printf("********** UHS_ALL_ADDR_TEST **********\r\n");
        // uhs_all_addr_test();
    }
    // uhs_phy_printfe("!!!!!!!!!! uhs_phy_cal_res->err_type = %d !!!!!!!!!!\r\n",uhs_phy_cal_res->err_type);l
    uint32_t magic_os = 0x89abcdef;
    uhs_phy_cal_res->err_type += magic_os;
    uhs_phy_cal_res->cal_done = magic_os;
    uhs_phy_cal_res->crc_res = BFLB_Soft_CRC32(uhs_phy_cal_res, sizeof(uhs_phy_cal_res_struct)-4);
    #elif CAL_MODE == 1
    uhs_phy_cal_res->cal_done = 1;
    uhs_phy_cal_res->crc_res = BFLB_Soft_CRC32(uhs_phy_cal_res, sizeof(uhs_phy_cal_res_struct)-4);
    #endif

    #if CAL_MODE != 2
    uhs_phy_printf("!!!!!!!!!! uhs_phy_cal_res->err_type = %d !!!!!!!!!!\r\n",uhs_phy_cal_res->err_type);
    #else
    uhs_phy_printf("!!!!!!!!!! uhs_phy_cal_res->err_type = %lx !!!!!!!!!!\r\n",uhs_phy_cal_res->err_type);
    #endif

    dump_uhs_phy_cal_res();
    return uhs_phy_cal_res->err_type;

    //get dcache original state
    __DSB();
    __ISB();
    dcache_original = __get_MHCR();
    dcache_original &= (0x1<<1);
    __DSB();
    __ISB();
    uhs_phy_printf_debug("dcache_original= 0x%lx\r\n",dcache_original);

    uhs_phy_printf("UHS_PHY_CAL, CACHE_EN = %d\r\n",CACHE_EN);
    #if CACHE_EN
    csi_dcache_enable();
    #else
    csi_dcache_disable();
    #endif

    //get dcache current state
    __DSB();
    __ISB();
    dcache_current = __get_MHCR();
    dcache_current &= (0x1<<1);
    __DSB();
    __ISB();
    uhs_phy_printf_debug("dcache_current= 0x%lx\r\n",dcache_current);

    cfg->pck_freq = pck_freq_temp;
    #if CACHE_EN
    if(dcache_current == (0x1<<1))
    {
        self_cal();
    }
    else
    {
        uhs_phy_printf_debug("dcache enable fail\r\n");
        return uhs_err_handler(UHS_CACHE_ENABLE_ERR);
    }
    if (dcache_original == 0)
    {
            csi_dcache_disable();
    }
    #else
    if(dcache_current == 0x0)
    {
        self_cal();
    }
    else
    {
        uhs_phy_printf_debug("dcache disable fail\r\n");
        return uhs_err_handler(UHS_CACHE_DISABLE_ERR);
    }
    if (dcache_original == (0x1<<1))
    {
        csi_dcache_enable();
    }
    #endif

    //get dcache end state
    __DSB();
    __ISB();
    dcache_end = __get_MHCR();
    dcache_end &= (0x1<<1);
    __DSB();
    __ISB();
    if(dcache_end == dcache_original)
    {
        uhs_phy_printf_debug("dcache state right , dcache_state= 0x%lx\r\n",dcache_end);
    }
    else
    {
        uhs_phy_printf_debug("dcache state error\r\n");
        return uhs_err_handler(UHS_CACHE_RECOVER_ERR);
    }

    uhs_phy_delay_ms(1);

    if (cfg->psramMemSize == PSRAM_MEM_SIZE_32MB){
        uhs_phy_printf("########## END_CAL_AT %ldMbps, PSRAM_MEM_SIZE_32MB ##########\r\n",cfg->pck_freq);
    }else if(cfg->psramMemSize == PSRAM_MEM_SIZE_64MB){
        uhs_phy_printf("########## END_CAL_AT %ldMbps, PSRAM_MEM_SIZE_64MB ##########\r\n",cfg->pck_freq);
    }
}
